<template>
  <div class="p">
    <Breadcrumbs :items="breadCrumbs"/> 
    <NavBlock :navItems="navSvedenItems" :activeIndex="5"/>
    <DotTitle text="Сведения об образовательной организации" />
    <TitleCommon :text="titleCommon"/>

    <AccordionTeacher
      v-for="teacher in teacherList"
      :key="teacher.id"
      :title="teacher.title"
      :tags="teacher.tags"
    >
      <AccContent
        :diploma="{ text: teacher.diploma }"
        :document="{ text: teacher.document }"
        :specialty="teacher.specialty"
        :programs="teacher.programs"
      />
    </AccordionTeacher>
    <span style="display:block; margin-bottom: 60px;"></span>
  </div>
</template>

<script setup lang="ts">
import Breadcrumbs from '@/components/UI/Breadcrumbs.vue';
import DotTitle from '@/components/UI/DotTitle.vue';
import TitleCommon from '@/components/UI/TitleCommon.vue';
import NavBlock from '@/components/UI/NavBlock.vue'
import AccordionTeacher from '@/components/UI/AccordeonTeacher.vue'
import AccContent from '@/components/UI/AccContent.vue'
import { navSvedenItems } from '@/utils/svedenUtils'

const titleCommon = ref('Руководство. Педагогический (научно-педагогический) состав')

const breadCrumbs = [
  { text: 'Главная', link: '/' },
  { text: 'Сведения об организации', link: '/sveden/common/' },
  { text: titleCommon.value, link: '/sveden/vacant/' }
] 

const hrapovaList = [
  'Общие требования промышленной безопасности в химической,  нефтехимической и нефтегазоперерабатывающей промышленности.',
  'Требования промышленной безопасности в нефтяной и газовой промышленности.',
  'Требования промышленной безопасности  к оборудованию, работающему под давлением.',
  'Обучение для сливщиков-разливщиков.',
  'Обучение для персонала, эксплуатирующего химически  опасные производственные объекты (ХОПО).',
  'Обучение для персонала взрывопожароопасных химических  и нефтехимических производств.',
  'Обучение персонала, обслуживающего сосуды (газификаторы, баллоны),  работающие под давлением для  хранения медицинского кислорода.',
  'Обучение персонала ХОПО, на которых используются  и хранятся токсичные и высокотоксичные вещества.',
  'Обучение персонала ХОПО, на которых хранятся  и используются неорганические жидкие кислоты и щелочи.',
  'Обучение персонала ХОПО, на которых получаются, используются  и хранятся окисляющие вещества (кислород, озон).'
]

const smolovikList = [
  'Общие требования промышленной безопасности;',
  'Требования промышленной безопасности к подъемным сооружениям;',
  'Стропальщик;',
  'Рабочий персонал эксплуатирующий подъемные сооружения;'
]

const raevskiList = [
  'Общие требования промышленной безопасности;',
  'Требования промышленной безопасности к подъемным сооружениям;',
  'Стропальщик;',
  'Рабочий персонал эксплуатирующий подъемные сооружения;'
]

const kozlovList = [
  'Требования промышленной безопасности к подъемным сооружениям;',
  'Стропальщик;',
  'Машинист крана (крановщик);',
  'Водитель погрузчика;',
  'Машинист автовышки и автогидроподъемника;',
  'Водитель электро и автотележки;',
  'Рабочий персонал эксплуатирующий подъемные сооружения;'
]

const diachukList = [
  'Общие требования промышленной безопасности;',
  'Требования промышленной безопасности к оборудованию, работающему под давлением;',
  'Требования промышленной безопасности на объектах газораспределения и газопотребления;',
  'Безопасная эксплуатация тепловых энергоустановок;',
  'Оператор котельной;',
  'Аппаратчик ХВО;',
  'Персонал, обслуживающий оборудование работающее под избыточным давлением;',
  'Персонал, обслуживающий газовое оборудование промышленных печей,сушильных установок и дымоотводящих устройств;',
  'Персонал, обслуживающий ТЭУ.'
]

const aleksandrovList = [
  'Охрана труда.',
]

const burmistrovList = [
  'Оператор котельной;',
  'Аппаратчик ХВО;',
  'Персонал обслуживающий оборудование, работающее под избыточным давлением;',
  'Персонал, обслуживающий газовое оборудование промышленных печей, сушильных установок и дымоотводящих устройств;',
  'Персонал, обслуживающий сосуды (газификаторы, баллоны), работающие под избыточным давлением, для хранения медицинского кислорода;',
  'Персонал, обслуживающий ТЭУ;'
]

const teacherList = [
  {
    id: 1,
    title: 'Храпова Лариса Васильевна',
    tags: [ 'Преподаватель', 'Инженер-химик технолог', 'Высшее образование', 'Химическая технология лаков, красок и лакокрасочных покрытий' ],
    diploma: 'Диплом о профессиональной переподготовке №772411478303 от 30.06.2020 “Преподаватель в сфере дополнительного профессионального образования”',
    specialty: 'Химическая технология лаков, красок и лакокрасочных покрытий',
    programs: hrapovaList
  },
  {
    id: 2,
    title: 'Смоловик Андрей Евгеньевич',
    tags: [ 'Доцент', 'Инженер-механик', 'Кандидат технических наук', 'Подъемно-транспортные машины и оборудование' ],
    document: ['Удостоверение о повышении квалификации No180001938665 о 20.11.2019, Использование электронной информационно-образовательной среды и информационно-коммуникационных технологий в образовательном процессе'],
    specialty: 'Подъемно-транспортные машины и оборудование',
    programs: smolovikList
  },
  {
    id: 3,
    title: 'Раевский Владимир Алексеевич',
    tags: [ 'Старший преподаватель', 'Инженер-механик', 'Кандидат технических наук', 'Технология и оборудование сварочного производства' ],
    diploma: 'Диплом о профессиональной переподготовке No 642407801489 от 31.10.2018 г. Системное администрирование информационных технологий',
    document: ['Удостоверение о повышении квалификации No 180001540932 от 08.02.2018 г. Актуальные вопросы профессионально деятельности научно-педагогического работника МГТУ им. Н.Э. Баумана;',
      'Удостоверение о повышении квалификации No 402409712012 от 31.10.2019 г. Использование современных информационных технологий и ресурсов в электронной информационно-образовательной среде ВУЗа',
      'Удостоверение о повышении квалификации No 402409712389 от 07.11.2019 г. Безопасность и охрана труда'
    ],
    specialty: 'Технология и оборудование сварочного производства',
    programs: raevskiList
  },
  {
    id: 4,
    title: 'Козлов Сергей Викторович',
    tags: [ 'Преподаватель', 'Инженер-механик', 'Высшее образование', 'Подъемно-транспортные машины и оборудование' ],
    diploma: 'Диплом о профессионально переподготовке No 772406959764 от 03.09.2018 Педагог профессионально обучения;',
    document: 'Удостоверение о повышении квалификации No 029455 от 18.02.2022 Требования охраны труда — основны изменения в трудовом законодательстве на 01.03.2022г.',
    specialty: 'Подъемно-транспортные машины и оборудование',
    programs:  kozlovList
  },
  {
    id: 5,
    title: 'Дьячук Виктор Васильевич',
    tags: [ 'Преподаватель', 'Инженер-теплоэнергетик', 'Промышленная теплоэнергетика'],
    document: 'Удостоверение о повышении квалификации No 772412023611 от 11.09.2020 Требования промышленной безопасности на объектах газораспределени и газопотребления Б.7.1. Эксплуатация систем газораспределени и газопотребления',
    specialty: 'Промышленная теплоэнергетика',
    programs: diachukList
  },
  {
    id: 6,
    title: 'Александров Виталий Владилинович',
    tags: [ 'Преподаватель', 'Инженер-теплоэнергетик', 'Финансы и кредит' ],
    programs: aleksandrovList
  },
  {
    id: 7,
    title: 'Бурмистров Сергей Анатольевич',
    tags: [ 'Преподаватель', 'Инженер-теплоэнергетик', 'Высшее образование', 'Тепловые и электрические станции' ],
    diploma: 'Диплом о профессиональной переподготоваке №772411478303 от 30.06.2020  “Преподаватель в сфере дополнительного профессионально образования”',
    specialty: 'Химическая технология лаков, красок и лакокрасочных покрытий',
    programs: burmistrovList
  }
]



</script>

<style scoped>
/* Можно писать CSS, если нужно */
</style>
